config/p1soap.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://com.ztesoft.zsmart/xsd">
    <soapenv:Header>
        <xsd:AuthHeader>
            <Username>NY</Username>
            <Password>smart</Password>
            <ChannelCode>Devetel</ChannelCode>
        </xsd:AuthHeader>
    </soapenv:Header>
    <soapenv:Body>
        <xsd:RechargeBO>
            <TransactionSN>1589288094591016</TransactionSN>
            <DealerCode>JJD</DealerCode>
            <PaymentChannelID>23</PaymentChannelID>
            <ServiceNumber>56920597737</ServiceNumber>
            <AccountCode/>
            <AcctResCode/>
            <AddBalance>-50000000</AddBalance>
            <AddDays/>
            <OperationStaff/>
            <InactiveDuration/>
        </xsd:RechargeBO>
    </soapenv:Body>
</soapenv:Envelope>